# FndError

## Description
Function FndError returns whether an error has occurred within a VectorScript subroutine. Provided as a debugging tool, FndError receives notification after execution of every line of code whether an error has occurred.

```pascal
FUNCTION FndError : BOOLEAN;
```

```python

def vs.FndError():
    return BOOLEAN
```

## Remarks
This example isn't very helpful. JDW.<BR>
[sd 8/14/98]

## Version
Availability: from MiniCAD
## Category
* Utility